svallus/WireGuard-ESP32-Arduino/src/wireguardif.c
/*
 * Ported to ESP32 Arduino by Kenta Ida (fuga@fugafuga.org)
 * The original license is below:
 *
 * Copyright (c) 2021 Daniel Hope (www.floorsense.nz)
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *  list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice, this
 *  list of conditions and the following disclaimer in the documentation and/or
 *  other materials provided with the distribution.
 *
 * 3. Neither the name of "Floorsense Ltd", "Agile Workspace Ltd" nor the names of
 *  its contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * Author: Daniel Hope <daniel.hope@smartalock.com>
 */

//FIXED added include due to Serial.printf(
// #include <Arduino.h>
// #include <stdio.h>


#include "wireguardif.h"

#include <string.h>
#include <stdlib.h>

#include "lwip/netif.h"
#include "lwip/ip.h"
#include "lwip/udp.h"
#include "lwip/mem.h"
#include "lwip/sys.h"
#include "lwip/timeouts.h"

#include "wireguard.h"
#include "crypto.h"
#include "esp_log.h"

//FIXED
/* IDF >= 4.1 removed tcpip_adapter in favour of esp_netif.
 * Detect which API to use at compile-time based on esp_idf_version.h
 * (available from IDF 4.0). IDF < 4.0 falls through to tcpip_adapter. */
#if __has_include("esp_idf_version.h")
#  include "esp_idf_version.h"
#  if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 1, 0)
#    define WIREGUARD_USE_ESP_NETIF
#  endif
#endif

#ifdef WIREGUARD_USE_ESP_NETIF
#  include "esp_netif.h"
#else
#  include "tcpip_adapter.h"
#endif

#include "esp32-hal-log.h"

#define WIREGUARDIF_TIMER_MSECS 400

#define TAG "[WireGuard] "

static void update_peer_addr(struct wireguard_peer *peer, const ip_addr_t *addr, u16_t port)
{
	peer->ip = *addr;
	peer->port = port;
}

static struct wireguard_peer *peer_lookup_by_allowed_ip(struct wireguard_device *device, const ip_addr_t *ipaddr)
{
	if (device == NULL) {
    	   return NULL;
    	}
	
	struct wireguard_peer *result = NULL;
	struct wireguard_peer *tmp;
	int x;
	int y;
	for (x = 0; (!result) && (x < WIREGUARD_MAX_PEERS); x++)
	{
		tmp = &device->peers[x];
		if (tmp->valid)
		{
			for (y = 0; y < WIREGUARD_MAX_SRC_IPS; y++)
			{
				if ((tmp->allowed_source_ips[y].valid) && ip_addr_netcmp(ipaddr, &tmp->allowed_source_ips[y].ip, ip_2_ip4(&tmp->allowed_source_ips[y].mask)))
				{
					result = tmp;
					break;
				}
			}
		}
	}
	return result;
}

static bool wireguardif_can_send_initiation(struct wireguard_peer *peer)
{
	return ((peer->last_initiation_tx == 0) || (wireguard_expired(peer->last_initiation_tx, REKEY_TIMEOUT)));
}

static err_t wireguardif_peer_output(struct netif *netif, struct pbuf *q, struct wireguard_peer *peer)
{
	struct wireguard_device *device = (struct wireguard_device *)netif->state;
	// Send to last know port, not the connect port
	// TODO: Support DSCP and ECN - lwip requires this set on PCB globally, not per packet

	//FIXED
	log_i(TAG 
          "\n WG UDP OUT -> %d.%d.%d.%d:%d via %c%c, len=%d \n",
          ip4_addr1(&peer->ip.u_addr.ip4),
          ip4_addr2(&peer->ip.u_addr.ip4),
          ip4_addr3(&peer->ip.u_addr.ip4),
          ip4_addr4(&peer->ip.u_addr.ip4),
          peer->port,
          device->underlying_netif->name[0],
          device->underlying_netif->name[1],
          q->tot_len);

	err_t err = udp_sendto_if(device->udp_pcb,
                              q,
                              &peer->ip,
                              peer->port,
                              device->underlying_netif);

	log_i(TAG, "WG UDP OUT result=%d", err);
	return err;
}

static err_t wireguardif_device_output(struct wireguard_device *device, struct pbuf *q, const ip_addr_t *ipaddr, u16_t port)
{
	return udp_sendto_if(device->udp_pcb, q, ipaddr, port, device->underlying_netif);
}

static err_t wireguardif_output_to_peer(struct netif *netif, struct pbuf *q, const ip_addr_t *ipaddr, struct wireguard_peer *peer)
{
	// The LWIP IP layer wants to send an IP packet out over the interface - we need to encrypt and send it to the peer
	struct message_transport_data *hdr;
	struct pbuf *pbuf;
	err_t result;
	size_t unpadded_len;
	size_t padded_len;
	size_t header_len = 16;
	uint8_t *dst;
	uint32_t now;
	struct wireguard_keypair *keypair = &peer->curr_keypair;

	// Note: We may not be able to use the current keypair if we haven't received data, may need to resort to using previous keypair
	if (keypair->valid && (!keypair->initiator) && (keypair->last_rx == 0))
	{
		keypair = &peer->prev_keypair;
	}

	if (keypair->valid && (keypair->initiator || keypair->last_rx != 0))
	{

		if (
			!wireguard_expired(keypair->keypair_millis, REJECT_AFTER_TIME) &&
			(keypair->sending_counter < REJECT_AFTER_MESSAGES))
		{

			// Calculate the outgoing packet size - round up to next 16 bytes, add 16 bytes for header
			if (q)
			{
				// This is actual transport data
				unpadded_len = q->tot_len;
			}
			else
			{
				// This is a keep-alive
				unpadded_len = 0;
			}
			padded_len = (unpadded_len + 15) & 0xFFFFFFF0; // Round up to next 16 byte boundary

			// The buffer needs to be allocated from "transport" pool to leave room for LwIP generated IP headers
			// The IP packet consists of 16 byte header (struct message_transport_data), data padded upto 16 byte boundary + encrypted auth tag (16 bytes)
			pbuf = pbuf_alloc(PBUF_TRANSPORT, header_len + padded_len + WIREGUARD_AUTHTAG_LEN, PBUF_RAM);
			if (pbuf)
			{
				log_v(TAG "preparing transport data...");
				// Note: allocating pbuf from RAM above guarantees that the pbuf is in one section and not chained
				// - i.e payload points to the contiguous memory region
				memset(pbuf->payload, 0, pbuf->tot_len);

				hdr = (struct message_transport_data *)pbuf->payload;

