svallus/WireGuard-ESP32-Arduino/src/wireguardif.c
				hdr->type = MESSAGE_TRANSPORT_DATA;
				hdr->receiver = keypair->remote_index;
				// Alignment required... pbuf_alloc has probably aligned data, but want to be sure
				U64TO8_LITTLE(hdr->counter, keypair->sending_counter);

				// Copy the encrypted (padded) data to the output packet - chacha20poly1305_encrypt() can encrypt data in-place which avoids call to mem_malloc
				dst = &hdr->enc_packet[0];
				if ((padded_len > 0) && q)
				{
					// Note: before copying make sure we have inserted the IP header checksum
					// The IP header checksum (and other checksums in the IP packet - e.g. ICMP) need to be calculated by LWIP before calling
					// The Wireguard interface always needs checksums to be generated in software but the base netif may have some checksums generated by hardware

					// Copy pbuf to memory - handles case where pbuf is chained
					pbuf_copy_partial(q, dst, unpadded_len, 0);
				}

				//FIXED 				
				log_d(TAG 
					"\nWG TX BEFORE ENC: "
					"keypair=%p valid=%d initiator=%d "
					"local=%08x remote=%08x counter=%llu "
					"send_valid=%d recv_valid=%d\n",
					keypair,
					keypair->valid,
					keypair->initiator,
					keypair->local_index,
					keypair->remote_index,
					keypair->sending_counter,
					keypair->sending_valid,
					keypair->receiving_valid
				);

				// Then encrypt
				wireguard_encrypt_packet(dst, dst, padded_len, keypair);

				//FIXED				
				// printf("WG TX ENC: ");
				// for (int i = 0; i < 32; i++)
				// 	printf("%02X", dst[i]);
				// printf("\n");

				result = wireguardif_peer_output(netif, pbuf, peer);

				if (result == ERR_OK)
				{
					now = wireguard_sys_now();
					peer->last_tx = now;
					keypair->last_tx = now;
				}

				pbuf_free(pbuf);

				// Check to see if we should rekey
				if (keypair->sending_counter >= REKEY_AFTER_MESSAGES)
				{
					peer->send_handshake = true;
				}
				else if (keypair->initiator && wireguard_expired(keypair->keypair_millis, REKEY_AFTER_TIME))
				{
					peer->send_handshake = true;
				}
			}
			else
			{
				// Failed to allocate memory
				result = ERR_MEM;
			}
		}
		else
		{
			// key has expired...
			keypair_destroy(keypair);
			result = ERR_CONN;
		}
	}
	else
	{
		// No valid keys!
		result = ERR_CONN;
	}
	return result;
}

// This is used as the output function for the Wireguard netif
// The ipaddr here is the one inside the VPN which we use to lookup the correct peer/endpoint
static err_t wireguardif_output(struct netif *netif, struct pbuf *q, const ip4_addr_t *ip4addr)
{
	log_i(TAG,
      		"WG OUTPUT: dst=%d.%d.%d.%d netif=%c%c \n",
      		ip4_addr1(ip4addr),
      		ip4_addr2(ip4addr),
      		ip4_addr3(ip4addr),
      		ip4_addr4(ip4addr),
      		netif->name[0],
      		netif->name[1]);

	struct wireguard_device *device = (struct wireguard_device *)netif->state;
	// Send to peer that matches dest IP
	ip_addr_t ipaddr;
	ip_addr_copy_from_ip4(ipaddr, *ip4addr);
	struct wireguard_peer *peer = peer_lookup_by_allowed_ip(device, &ipaddr);
	if (peer)
	{
		return wireguardif_output_to_peer(netif, q, &ipaddr, peer);
	}
	else
	{
		return ERR_RTE;
	}
}

static void wireguardif_send_keepalive(struct wireguard_device *device, struct wireguard_peer *peer)
{
	// Send a NULL packet as a keep-alive
	wireguardif_output_to_peer(device->netif, NULL, NULL, peer);
}

static void wireguardif_process_response_message(struct wireguard_device *device, struct wireguard_peer *peer, struct message_handshake_response *response, const ip_addr_t *addr, u16_t port)
{
	if (wireguard_process_handshake_response(device, peer, response))
	{
		// Packet is good
		// Update the peer location
		log_i(TAG "good handshake from %08x:%d", addr->u_addr.ip4.addr, port);
		update_peer_addr(peer, addr, port);

		wireguard_start_session(peer, true);
		wireguardif_send_keepalive(device, peer);

		// Set the IF-UP flag on netif
		netif_set_link_up(device->netif);
	}
	else
	{
		// Packet bad
		log_i(TAG "bad handshake from %08x:%d", addr->u_addr.ip4.addr, port);
	}
}

static bool peer_add_ip(struct wireguard_peer *peer, ip_addr_t ip, ip_addr_t mask)
{
	bool result = false;
	struct wireguard_allowed_ip *allowed;
	int x;
	// Look for existing match first
	for (x = 0; x < WIREGUARD_MAX_SRC_IPS; x++)
	{
		allowed = &peer->allowed_source_ips[x];
		if ((allowed->valid) && ip_addr_cmp(&allowed->ip, &ip) && ip_addr_cmp(&allowed->mask, &mask))
		{
			result = true;
			break;
		}
	}
	if (!result)
	{
		// Look for a free slot
		for (x = 0; x < WIREGUARD_MAX_SRC_IPS; x++)
		{
			allowed = &peer->allowed_source_ips[x];
			if (!allowed->valid)
			{
				allowed->valid = true;
				allowed->ip = ip;
				allowed->mask = mask;
				result = true;
				break;
			}
		}
	}
	return result;
}

static void wireguardif_process_data_message(struct wireguard_device *device, struct wireguard_peer *peer, struct message_transport_data *data_hdr, size_t data_len, const ip_addr_t *addr, u16_t port)
{
	struct wireguard_keypair *keypair;
	uint64_t nonce;
	uint8_t *src;
	size_t src_len;
	struct pbuf *pbuf;
	struct ip_hdr *iphdr;
	ip_addr_t dest;
	bool dest_ok = false;
	int x;
	uint32_t now;
	uint16_t header_len = 0xFFFF;
	uint32_t idx = data_hdr->receiver;

	keypair = get_peer_keypair_for_idx(peer, idx);
	
	//FIXED
	log_d(TAG "WG RX DATA: receiver=%08x counter=%llu keypair=%p\n",
		idx,
		nonce,
		keypair);

	if (keypair)
	{
		if (
			(keypair->receiving_valid) &&
			!wireguard_expired(keypair->keypair_millis, REJECT_AFTER_TIME) &&
			(keypair->sending_counter < REJECT_AFTER_MESSAGES)

		)
		{

			nonce = U8TO64_LITTLE(data_hdr->counter);
			src = &data_hdr->enc_packet[0];
			src_len = data_len;

			// We don't know the unpadded size until we have decrypted the packet and validated/inspected the IP header
			pbuf = pbuf_alloc(PBUF_TRANSPORT, src_len - WIREGUARD_AUTHTAG_LEN, PBUF_RAM);
			if (pbuf)
			{
				// Decrypt the packet
				memset(pbuf->payload, 0, pbuf->tot_len);
				if (wireguard_decrypt_packet(pbuf->payload, src, src_len, nonce, keypair))
				{
					//FIXED
					log_d(TAG "WG RX DECRYPT: SUCCESS\n");

					// 3. Since the packet has authenticated correctly, the source IP of the outer UDP/IP packet is used to update the endpoint for peer TrMv...WXX0.
					// Update the peer location
					update_peer_addr(peer, addr, port);

					now = wireguard_sys_now();
					keypair->last_rx = now;
					peer->last_rx = now;

