svallus/WireGuard-ESP32-Arduino/src/wireguardif.c
	if (wireguard_check_mac1(device, data, sizeof(struct message_handshake_initiation) - (2 * WIREGUARD_COOKIE_LEN), msg->mac1))
	{
		// mac1 is valid!
		if (!wireguard_is_under_load())
		{
			// If we aren't under load we only need mac1 to be correct
			result = true;
		}
		else
		{
			// If we are under load then check mac2
			source_len = get_source_addr_port(addr, port, source_buf, sizeof(source_buf));

			result = wireguard_check_mac2(device, data, sizeof(struct message_handshake_initiation) - (WIREGUARD_COOKIE_LEN), source_buf, source_len, msg->mac2);

			if (!result)
			{
				// mac2 is invalid (cookie may have expired) or not present
				// 5.3 Denial of Service Mitigation & Cookies
				// If the responder receives a message with a valid msg.mac1 yet with an invalid msg.mac2, and is under load, it may respond with a cookie reply message
				wireguardif_send_handshake_cookie(device, msg->mac1, msg->sender, addr, port);
			}
		}
	}
	else
	{
		// mac1 is invalid
	}
	return result;
}

static bool wireguardif_check_response_message(struct wireguard_device *device, struct message_handshake_response *msg, const ip_addr_t *addr, u16_t port)
{
	bool result = false;
	uint8_t *data = (uint8_t *)msg;
	uint8_t source_buf[18];
	size_t source_len;
	// We received an initiation packet check it is valid

	if (wireguard_check_mac1(device, data, sizeof(struct message_handshake_response) - (2 * WIREGUARD_COOKIE_LEN), msg->mac1))
	{
		// mac1 is valid!
		if (!wireguard_is_under_load())
		{
			// If we aren't under load we only need mac1 to be correct
			result = true;
		}
		else
		{
			// If we are under load then check mac2
			source_len = get_source_addr_port(addr, port, source_buf, sizeof(source_buf));

			result = wireguard_check_mac2(device, data, sizeof(struct message_handshake_response) - (WIREGUARD_COOKIE_LEN), source_buf, source_len, msg->mac2);

			if (!result)
			{
				// mac2 is invalid (cookie may have expired) or not present
				// 5.3 Denial of Service Mitigation & Cookies
				// If the responder receives a message with a valid msg.mac1 yet with an invalid msg.mac2, and is under load, it may respond with a cookie reply message
				wireguardif_send_handshake_cookie(device, msg->mac1, msg->sender, addr, port);
			}
		}
	}
	else
	{
		// mac1 is invalid
	}
	return result;
}

void wireguardif_network_rx(void *arg, struct udp_pcb *pcb, struct pbuf *p, const ip_addr_t *addr, u16_t port)
{
	LWIP_ASSERT("wireguardif_network_rx: invalid arg", arg != NULL);
	LWIP_ASSERT("wireguardif_network_rx: invalid pbuf", p != NULL);
	// We have received a packet from the base_netif to our UDP port - process this as a possible Wireguard packet
	struct wireguard_device *device = (struct wireguard_device *)arg;
	struct wireguard_peer *peer;
	uint8_t *data = p->payload;
	size_t len = p->len; // This buf, not chained ones

	struct message_handshake_initiation *msg_initiation;
	struct message_handshake_response *msg_response;
	struct message_cookie_reply *msg_cookie;
	struct message_transport_data *msg_data;

	uint8_t type = wireguard_get_message_type(data, len);
	ESP_LOGV(TAG, "network_rx: %08x:%d", addr->u_addr.ip4.addr, port);

	switch (type)
	{
	case MESSAGE_HANDSHAKE_INITIATION:
		msg_initiation = (struct message_handshake_initiation *)data;
		log_i(TAG "HANDSHAKE_INITIATION: %08x:%d", addr->u_addr.ip4.addr, port);
		// Check mac1 (and optionally mac2) are correct - note it may internally generate a cookie reply packet
		if (wireguardif_check_initiation_message(device, msg_initiation, addr, port))
		{

			peer = wireguard_process_initiation_message(device, msg_initiation);
			if (peer)
			{
				// Update the peer location
				update_peer_addr(peer, addr, port);

				// Send back a handshake response
				wireguardif_send_handshake_response(device, peer);
			}
		}
		break;

	case MESSAGE_HANDSHAKE_RESPONSE:
		log_i(TAG "HANDSHAKE_RESPONSE: %08x:%d", addr->u_addr.ip4.addr, port);
		msg_response = (struct message_handshake_response *)data;

		// Check mac1 (and optionally mac2) are correct - note it may internally generate a cookie reply packet
		if (wireguardif_check_response_message(device, msg_response, addr, port))
		{

			peer = peer_lookup_by_handshake(device, msg_response->receiver);
			if (peer)
			{
				// Process the handshake response
				wireguardif_process_response_message(device, peer, msg_response, addr, port);
			}
		}
		break;

	case MESSAGE_COOKIE_REPLY:
		log_i(TAG "COOKIE_REPLY: %08x:%d", addr->u_addr.ip4.addr, port);
		msg_cookie = (struct message_cookie_reply *)data;
		peer = peer_lookup_by_handshake(device, msg_cookie->receiver);
		if (peer)
		{
			if (wireguard_process_cookie_message(device, peer, msg_cookie))
			{
				// Update the peer location
				update_peer_addr(peer, addr, port);

				// Don't send anything out - we stay quiet until the next initiation message
			}
		}
		break;

	case MESSAGE_TRANSPORT_DATA:
		ESP_LOGV(TAG, "TRANSPORT_DATA: %08x:%d", addr->u_addr.ip4.addr, port);

		msg_data = (struct message_transport_data *)data;
		peer = peer_lookup_by_receiver(device, msg_data->receiver);
		if (peer)
		{
			// header is 16 bytes long so take that off the length
			wireguardif_process_data_message(device, peer, msg_data, len - 16, addr, port);
		}
		break;

	default:
		// Unknown or bad packet header
		break;
	}
	// Release data!
	pbuf_free(p);
}

static err_t wireguard_start_handshake(struct netif *netif, struct wireguard_peer *peer)
{
	struct wireguard_device *device = (struct wireguard_device *)netif->state;
	err_t result;
	struct pbuf *pbuf;
	struct message_handshake_initiation msg;

	pbuf = wireguardif_initiate_handshake(device, peer, &msg, &result);
	if (pbuf)
	{
		result = wireguardif_peer_output(netif, pbuf, peer);
		log_i(TAG "start handshake %08x,%d - %d", peer->ip.u_addr.ip4.addr, peer->port, result);
		pbuf_free(pbuf);
		peer->send_handshake = false;
		peer->last_initiation_tx = wireguard_sys_now();
		memcpy(peer->handshake_mac1, msg.mac1, WIREGUARD_COOKIE_LEN);
		peer->handshake_mac1_valid = true;
	}
	return result;
}

static err_t wireguardif_lookup_peer(struct netif *netif, u8_t peer_index, struct wireguard_peer **out)
{
	LWIP_ASSERT("netif != NULL", (netif != NULL));
	LWIP_ASSERT("state != NULL", (netif->state != NULL));
	struct wireguard_device *device = (struct wireguard_device *)netif->state;
	struct wireguard_peer *peer = NULL;
	err_t result;

	if (device->valid)
	{
		peer = peer_lookup_by_peer_index(device, peer_index);
		if (peer)
		{
			result = ERR_OK;
		}
		else
		{
			result = ERR_ARG;
		}
	}
	else
	{
		result = ERR_ARG;
	}
	*out = peer;
	return result;
}

err_t wireguardif_connect(struct netif *netif, u8_t peer_index)
{
	struct wireguard_peer *peer;
	err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
	if (result == ERR_OK)
	{
		// Check that a valid connect ip and port have been set
		if (!ip_addr_isany(&peer->connect_ip) && (peer->connect_port > 0))
		{
			// Set the flag that we want to try connecting
			peer->active = true;
			peer->ip = peer->connect_ip;
			peer->port = peer->connect_port;
			result = ERR_OK;
		}
		else
		{
			result = ERR_ARG;
		}
	}
	return result;
}

err_t wireguardif_disconnect(struct netif *netif, u8_t peer_index)
{
	struct wireguard_peer *peer;
	err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
	if (result == ERR_OK)
	{
		// Set the flag that we want to try connecting
		peer->active = false;
		// Wipe out current keys
		keypair_destroy(&peer->next_keypair);
		keypair_destroy(&peer->curr_keypair);
		keypair_destroy(&peer->prev_keypair);
		result = ERR_OK;
	}
	return result;
}

err_t wireguardif_peer_is_up(struct netif *netif, u8_t peer_index, ip_addr_t *current_ip, u16_t *current_port)
{
	struct wireguard_peer *peer;
	err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
	if (result == ERR_OK)
	{
		if ((peer->curr_keypair.valid) || (peer->prev_keypair.valid))
		{
			result = ERR_OK;
		}
		else
		{
			result = ERR_CONN;
		}
		if (current_ip)
		{
			*current_ip = peer->ip;
		}
		if (current_port)
		{
			*current_port = peer->port;
		}
	}
	return result;
}

err_t wireguardif_remove_peer(struct netif *netif, u8_t peer_index)
{
	struct wireguard_peer *peer;
	err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
	if (result == ERR_OK)
	{
		crypto_zero(peer, sizeof(struct wireguard_peer));
		peer->valid = false;
		result = ERR_OK;
	}
	return result;
}

err_t wireguardif_update_endpoint(struct netif *netif, u8_t peer_index, const ip_addr_t *ip, u16_t port)
{
	struct wireguard_peer *peer;
	err_t result = wireguardif_lookup_peer(netif, peer_index, &peer);
	if (result == ERR_OK)
	{
		peer->connect_ip = *ip;
		peer->connect_port = port;
		result = ERR_OK;
	}
	return result;
}

err_t wireguardif_add_peer(struct netif *netif, struct wireguardif_peer *p, u8_t *peer_index)
{
	LWIP_ASSERT("netif != NULL", (netif != NULL));
	LWIP_ASSERT("state != NULL", (netif->state != NULL));
	LWIP_ASSERT("p != NULL", (p != NULL));
	struct wireguard_device *device = (struct wireguard_device *)netif->state;
	err_t result;
	uint8_t public_key[WIREGUARD_PUBLIC_KEY_LEN];
	size_t public_key_len = sizeof(public_key);
	struct wireguard_peer *peer = NULL;

	uint8_t preshared_key[WIREGUARD_SESSION_KEY_LEN];
	size_t preshared_key_len = sizeof(preshared_key);
	wireguard_base64_decode(p->preshared_key, preshared_key, &preshared_key_len);

	uint32_t t1 = wireguard_sys_now();

	if (wireguard_base64_decode(p->public_key, public_key, &public_key_len) && (public_key_len == WIREGUARD_PUBLIC_KEY_LEN))
	{

