svallus/WireGuard-ESP32-Arduino/src/wireguardif.c
			udp = udp_new();

			if (udp)
			{
				result = udp_bind(udp, IP_ADDR_ANY, init_data->listen_port); // Note this listens on all interfaces! Really just want the passed netif
				if (result == ERR_OK)
				{
					device = (struct wireguard_device *)mem_calloc(1, sizeof(struct wireguard_device));
					if (device)
					{
						device->netif = netif;
						device->underlying_netif = underlying_netif;
						// udp_bind_netif(udp, underlying_netif);

						device->udp_pcb = udp;
						log_d(TAG "start device initialization");
						// Per-wireguard netif/device setup
						uint32_t t1 = wireguard_sys_now();
						if (wireguard_device_init(device, private_key))
						{
							uint32_t t2 = wireguard_sys_now();
							log_d(TAG "Device init took %ums\r\n", (t2 - t1));

#if LWIP_CHECKSUM_CTRL_PER_NETIF
							NETIF_SET_CHECKSUM_CTRL(netif, NETIF_CHECKSUM_ENABLE_ALL);
#endif
							netif->state = device;
							netif->name[0] = 'w';
							netif->name[1] = 'g';
							netif->output = wireguardif_output;
							netif->linkoutput = NULL;
							netif->hwaddr_len = 0;
							netif->mtu = WIREGUARDIF_MTU;
							// We set up no state flags here - caller should set them
							// NETIF_FLAG_LINK_UP is automatically set/cleared when at least one peer is connected
							netif->flags = 0;

							udp_recv(udp, wireguardif_network_rx, device);

							// Start a periodic timer for this wireguard device
							sys_timeout(WIREGUARDIF_TIMER_MSECS, wireguardif_tmr, device);

							result = ERR_OK;
						}
						else
						{
							log_e(TAG "failed to initialize WireGuard device.");
							mem_free(device);
							device = NULL;
							udp_remove(udp);
							result = ERR_ARG;
						}
					}
					else
					{
						log_e(TAG "failed to allocate device context.");
						udp_remove(udp);
						result = ERR_MEM;
					}
				}
				else
				{
					log_e(TAG "failed to bind UDP err=%d", result);
					udp_remove(udp);
				}
			}
			else
			{
				log_e(TAG "failed to allocate UDP");
				result = ERR_MEM;
			}
		}
		else
		{
			log_e(TAG "invalid init_data private key");
			result = ERR_ARG;
		}
	}
	else
	{
		log_e(TAG "netif or state is NULL: netif=%p, netif.state:%p", netif, netif ? netif->state : NULL);
		result = ERR_ARG;
	}
	return result;
}

void wireguardif_peer_init(struct wireguardif_peer *peer)
{
	LWIP_ASSERT("peer != NULL", (peer != NULL));
	memset(peer, 0, sizeof(struct wireguardif_peer));
	// Caller must provide 'public_key'
	peer->public_key = NULL;
	ip_addr_set_any(false, &peer->endpoint_ip);
	peer->endport_port = WIREGUARDIF_DEFAULT_PORT;
	peer->keep_alive = WIREGUARDIF_KEEPALIVE_DEFAULT;
	ip_addr_set_any(false, &peer->allowed_ip);
	ip_addr_set_any(false, &peer->allowed_mask);
	memset(peer->greatest_timestamp, 0, sizeof(peer->greatest_timestamp));
	peer->preshared_key = NULL;
}
